docs/02_cloud_deployment/load_test_results/end_of_test_summary_1000rps

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 5000 max VUs, 1m30s max duration (incl. graceful stop):
              * constant_request_rate: 1000.00 iterations/s for 1m0s (maxVUs: 2000-5000, gracefulStop: 30s)


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<300' p(95)=7.76ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 60001   999.839154/s
    checks_succeeded...................: 100.00% 60001 out of 60001
    checks_failed......................: 0.00%   0 out of 60001

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=4.07ms min=943.45µs med=4.35ms max=68.11ms p(90)=5.91ms p(95)=7.76ms
      { expected_response:true }............................................: avg=4.07ms min=943.45µs med=4.35ms max=68.11ms p(90)=5.91ms p(95)=7.76ms
    http_req_failed.........................................................: 0.00%  0 out of 60001
    http_reqs...............................................................: 60001  999.839154/s

    EXECUTION
    iteration_duration......................................................: avg=4.23ms min=1ms      med=4.42ms max=88.39ms p(90)=6.25ms p(95)=8.2ms 
    iterations..............................................................: 60001  999.839154/s
    vus.....................................................................: 6      min=3          max=29  
    vus_max.................................................................: 2000   min=2000       max=2000

    NETWORK
    data_received...........................................................: 10 MB  173 kB/s
    data_sent...............................................................: 6.9 MB 115 kB/s



running (1m00.0s), 0000/2000 VUs, 60001 complete and 0 interrupted iterations
constant_request_rate ✓ [ 100% ] 0000/2000 VUs  1m0s  1000.00 iters/s